1C_Автомойка/Автомойка_XML/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1C_Автомойка/Автомойка_XML/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Форма документа "Поступление товаров": мгновенный пересчёт сумм.

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)

	Строка = Элементы.Материалы.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Цена = ЦенаМатериала(Строка.Материал);
	ПересчитатьСтроку(Строка);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)

	Строка = Элементы.Материалы.ТекущиеДанные;
	Если Строка <> Неопределено Тогда
		ПересчитатьСтроку(Строка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)

	Объект.Сумма = Объект.Материалы.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Строка)

	Строка.Сумма = Строка.Количество * Строка.Цена;
	Объект.Сумма = Объект.Материалы.Итог("Сумма");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаМатериала(Материал)

	Если Не ЗначениеЗаполнено(Материал) Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Материал.Цена;

КонецФункции
